{
  "title": "UI/UX design",
  "link": "design",
  "skills": [
    {"interest": 80, "confidence": 65, "icon": "Affinity"},
    {"interest": 90, "confidence": 90, "icon": "Sketch"},
    {"interest": 50, "confidence": 45, "icon": "AutoCad"},
    {"interest": 20, "confidence": 10, "icon": "SolidWorks"},
    {"interest": 100, "confidence": 80, "icon": "Hotjar"}
  ],
  "description": "User interface (UI) design is the art of designing computer systems that do not cause excessive frustration to the user. User experience (UX) research is the skill of figuring out which UI elements cause frustration and how. It generally involves interviews, questionnaires and observation of users in their natural habitat. I currently study human-technology interaction in Tampere University of Technology.",
  "projectList": [
    {
      "name": "jere.pro",
      "link": "dotpro-design",
      "external": "https://jere.pro",
      "techStack": ["Affinity", "Sketch"],
      "github": "https://github.com/Juhannuspukki/jere.pro",
      "description": "Before starting my own website project, I used Affinity Designer to draw UI sketches. It turned out to be a good decision, since arranging components on a website is a lot easier in Affinity than HTML."
    },
    {
      "name": "Bubble Fighters",
      "link": "bubble-fighters-design",
      "external": "http://bubble-fighters.now.sh",
      "github": "https://github.com/Juhannuspukki/bubble-fighters",
      "techStack": ["Unity", "C#"],
      "description": "I was quarantined and had nothing better to do so I decided to ace the Kasetsart University game development course. I decided to re-create one of those Flash-based games. The process involved drawing all the sprites and the UI for the game."
    },
    {
      "name": "Bachelor's thesis",
      "link": "bsc",
      "external": "https://dspace.cc.tut.fi/dpub/handle/123456789/27191",
      "techStack": ["Affinity"],
      "description": "During my time at Neuro Event Labs Oy I had the opportunity to design their fleet management system. The design process is documented on my Bachelor's thesis. I was able to produce a clear and aesthetically pleasing UI using the existing design language."
    },
    {
      "name": "STO Finexter calculator",
      "link": "sto-calc-design",
      "external": "https://sto-calc.now.sh",
      "techStack": ["Sketch"],
      "description": "I was hired by construction material company STO Finexter to create a web calculator that demonstrates the thermal isolation capabilites of their new product. You can see the end result above."
    },
    {
      "name": "avaruuskerho.fi",
      "link": "avaruuskerho-design",
      "external": "https://avaruuskerho.fi",
      "github": "https://github.com/castortut/castor-web",
      "techStack": ["Affinity"],
      "description": "Before writing the actual code on avaruuskerho.fi I drew mockups, experimented with different designs and ran them through the board. I was able to come up with a rather spacey design, don't you think?"
    },
    {
      "name": "staticcharge.fi",
      "link": "staticcharge-design",
      "external": "https://staticcharge.fi",
      "techStack": ["Sketch"],
      "description": "StaticCharge is my company website. It is designed by me and it is also the first of my websites to feature a logo design of my own making."
    },
    {
      "name": "Evoir",
      "link": "evoir-design",
      "techStack": ["Affinity", "Sketch"],
      "description": "During my time in Collateral Solutions team I made designs for the Collateral Solutions website, Evoir website and the Evoir product itself."
    }
  ]
}
